const data = [
   {
      name: 'Ілля',
      role: 'Засновник та СЕО клубу',
      info: '"Добро та комунікація, об\'єднує, допомагає, зближує, робить світ кращим"',
      image_url: '/img/mentors/illya.png',
   },
   {
      name: 'Тетяна',
      role: 'Партнер та бізнес-менеджер ',
      info: '"Чим більше допомагаєш іншим - тим більше отримуєш сам. Життя любить простих та добрих людей"',
      image_url: '/img/mentors/tetyana.png',
   },
   {
      name: 'Руслан',
      role: 'Засновник бізнес-клубу',
      info: '"Хобі — це те, що приносить задоволення, а задоволення, приносить допомогу іншим"',
      image_url: '/img/mentors/ruslan.png',
   },
   {
      name: 'Дар’я',
      role: 'Івент менеджер клубу',
      info: '"Якщо те, що ти робиш, робить щасливим тебе та людей навколо - сміливо йди вперед!"',
      image_url: '/img/mentors/darya.png',
   }
]

export {data};