const data = [
   {
      name: 'Ілля',
      role: 'Засновник та СЕО клубу',
      info: '"Добро та комунікація, об\'єднує, допомагає, зближує, робить світ кращим"',
      image_url: '/img/mentors/illya.png',
   },
   {
      name: 'Ілля',
      role: 'Засновник та СЕО клубу',
      info: '"Добро та комунікація, об\'єднує, допомагає, зближує, робить світ кращим"',
      image_url: '/img/mentors/tetyana.png',
   },
   // {
   //    name: 'Ілля',
   //    role: 'Засновник та СЕО клубу',
   //    info: '"Добро та комунікація, об\'єднує, допомагає, зближує, робить світ кращим"',
   //    image_url: '/img/mentors/illya.png',
   // },
   // {
   //    name: 'Ілля',
   //    role: 'Засновник та СЕО клубу',
   //    info: '"Добро та комунікація, об\'єднує, допомагає, зближує, робить світ кращим"',
   //    image_url: '/img/mentors/illya.png',
   // }
]

export {data};